app/controllers/application_controller.rb

INSERT INTO "forecasted_temperatures" ("date_forecasted", "min_forecasted", "max_forecasted", "created_at", "updated_at", "location_id") VALUES (?, ?, ?, ?, ?, ?)  [["date_forecasted", "2021-07-20"], ["min_forecasted", 15], ["max_forecasted", 15], ["created_at", "2021-07-21 02:38:25.519904"], ["updated_at", "2021-07-21 02:38:25.519904"], ["location_id", 17]]
---
	def create_temperatures(days, location, date)
		i = 1
		@number_days.times do
			ForecastedTemperature.create(date_forecasted: date, min_forecasted: days[i].min,
			max_forecasted: days[i].max, location_id: location.id)

SELECT "locations".* FROM "locations"
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def get_data
		if params[:location].present? #with this condition we can synchronize and add new forecasted temperatures only one location, url: POST /synchronize?location=slug_name
			@location = Location.friendly.find(params[:location])
			find_data(@location)
		else #here we can synchronize all the locations, url: POST /synchronize
			@locations = Location.all
			@locations.each do |location|