app/controllers/forecasted_temperatures_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "brussels"], ["LIMIT", 1]]
SELECT 1 AS one FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "brussels"], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "locations".* FROM "locations"
INSERT INTO "forecasted_temperatures" ("date_forecasted", "min_forecasted", "max_forecasted", "created_at", "updated_at", "location_id") VALUES (?, ?, ?, ?, ?, ?)  [["date_forecasted", "2021-07-17"], ["min_forecasted", 13], ["max_forecasted", 26], ["created_at", "2021-07-18 01:56:32.590977"], ["updated_at", "2021-07-18 01:56:32.590977"], ["location_id", 1]]
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ? AND (date_forecasted >= '2021-07-21')  [["location_id", 6]]
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ? AND "forecasted_temperatures"."date_forecasted" BETWEEN ? AND ?  [["location_id", 6], ["date_forecasted", "2021-07-21"], ["date_forecasted", "2021-07-21"]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ? AND (date_forecasted <= '2021-01-23') ORDER BY "forecasted_temperatures"."id" ASC LIMIT ?  [["location_id", 6], ["LIMIT", 1]]
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ? AND "forecasted_temperatures"."date_forecasted" BETWEEN ? AND ?  [["location_id", 6], ["date_forecasted", "2022-07-19"], ["date_forecasted", "2021-07-23"]]
---
	def show_location_temp

		if Location.where(slug: params[:location_id]).exists?
			@location = Location.friendly.find(params[:location_id])
		end

		if @location == nil
			render json: "ERROR:3 : No forecasted temperatures saved for this location"
		elsif params[:start_date].present? == false && params[:end_date].present? == false
			@forecasted_temperatures = @location.forecasted_temperatures
		elsif ((params[:start_date].present? && valid_date?(params[:start_date]) == false) || (params[:end_date].present? && valid_date?(params[:end_date]) == false))
			render json: "ERROR:5 : Not valid date format (date format must be YYYY-MM-DD)"
		elsif params[:end_date].present? && params[:end_date].to_date < @location.created_at.to_date
			render json: "ERROR:4 : No forecasted temperatures saved for this date"
		elsif (params[:start_date].present? && params[:end_date].present? && params[:start_date] > params[:end_date])
			render json: "ERROR:6 : the start date must be before the end date"
		elsif (params[:start_date].present? && params[:end_date].present?)
			@start_date = params[:start_date].to_date
			@end_date = params[:end_date].to_date
	 		@forecasted_temperatures = @location.forecasted_temperatures.where(:date_forecasted => @start_date..@end_date)
		elsif (params[:start_date].present? && params[:end_date].present? == false)
			@start_date = params[:start_date].to_date
			@forecasted_temperatures = @location.forecasted_temperatures.where('date_forecasted >= ?', @start_date)
		elsif (params[:end_date].present? && params[:start_date].present? == false)
			@end_date = params[:end_date].to_date
			@forecasted_temperatures = @location.forecasted_temperatures.where('date_forecasted <= ?', @end_date)