app/controllers/forecasted_temperatures_controller.rb

	def index
		@forecasted_temperatures = ForecastedTemperature.all
---
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures"

	def destroy
        @forecasted_temperatures = ForecastedTemperature.all
        @forecasted_temperature = ForecastedTemperature.find(params[:id])
        @forecasted_temperature.destroy
---
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."id" = ?  [["id", 1]]

	def create_temperatures(days, location, data)
		date = DateTime.parse(data["init"]).to_date
		i = 1
		@number_days.times do
			ForecastedTemperature.create(date_forecasted: date, min_forecasted: days[i].min,
			max_forecasted: days[i].max, location_id: location.id)
---
INSERT INTO "forecasted_temperatures" ("date_forecasted", "min_forecasted", "max_forecasted", "created_at", "updated_at", "location_id") VALUES (?, ?, ?, ?, ?, ?)  [["date_forecasted", "2021-07-17"], ["min_forecasted", 20], ["max_forecasted", 20], ["created_at", "2021-07-18 03:53:04.027536"], ["updated_at", "2021-07-18 03:53:04.027536"], ["location_id", 1]]

	def get_data
		@locations = Location.all
		@locations.each do |location|
---
SELECT "locations".* FROM "locations"

	def show_location_temp
		if Location.where(slug: params[:location_id]).exists?
			@location = Location.friendly.find(params[:location_id])
			@long = @location.longitude
			@lat = @location.latitude
        	@forecasted_temperatures = @location.forecasted_temperatures
			first_date = @forecasted_temperatures.first.date_forecasted
---
SELECT "locations".* FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "new-york"], ["LIMIT", 1]]
SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ?  [["location_id", 2]]