app/controllers/forecasted_temperatures_controller.rb

SELECT "forecasted_temperatures".* FROM "forecasted_temperatures" WHERE "forecasted_temperatures"."location_id" = ?  [["location_id", 6]]
---
	def show_location_temp
		if Location.where(slug: params[:location_id]).exists?
			@location = Location.friendly.find(params[:location_id])
        	@forecasted_temperatures = @location.forecasted_temperatures
			if params[:start_date].present? && params[:end_date].present? #to filter by start date and end date, url GET /slug_name?start_date=""&end_date=""
				@start_date = params[:start_date].to_date
				@end_date = params[:end_date].to_date
				@forecasted_temperatures = @location.forecasted_temperatures.where(:date_forecasted => @start_date..@end_date)
			elsif params[:start_date].present? #show all the forecasted temperature from start date (if only start_date specified)
				@start_date = params[:start_date].to_date
				@forecasted_temperatures = @location.forecasted_temperatures.where('date_forecasted >= ?', @start_date)