app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
    def destroy
        @locations = Location.all