app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "brussels"], ["LIMIT", 1]]
SELECT 1 AS one FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "cstm"], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
		if Location.where(id: params[:id]).exists? || Location.where(slug: params[:id]).exists?
			@location = Location.friendly.find(params[:id])

INSERT INTO "locations" ("latitude", "longitude", "slug_name", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["latitude", 50.0], ["longitude", 20.0], ["slug_name", "kllkd"], ["created_at", "2021-07-21 12:52:57.264177"], ["updated_at", "2021-07-21 12:52:57.264177"], ["slug", "kllkd"]]
---
	def create
		if validate_coord(params[:latitude], params[:longitude]) && validate_slug(params[:slug_name])
			@location = Location.create(
				longitude: params[:longitude],
				latitude: params[:latitude],
				slug_name: params[:slug_name]
			)

SELECT "locations".* FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "joel"], ["LIMIT", 1]]
SELECT 1 AS one FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "55"], ["LIMIT", 1]]
UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "slug_name" = ?, "updated_at" = ?, "slug" = ? WHERE "locations"."id" = ?  [["latitude", 78.0], ["longitude", 85.0], ["slug_name", "minirt"], ["updated_at", "2021-07-22 04:42:59.572876"], ["slug", "minirt"], ["id", 57]]
---
    def update
		if Location.where(id: params[:id]).exists? || Location.where(slug: params[:id]).exists?
			@location = Location.friendly.find(params[:id])
			old_slug = @location.slug_name
			if validate_coord(params[:latitude], params[:longitude]) && validate_slug(params[:slug_name])
				new_slug = params[:slug_name]
				@location.update(
					latitude: params[:latitude],
					longitude: params[:longitude],
					slug_name: params[:slug_name]
				)

SELECT "locations".* FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "minirt"], ["LIMIT", 1]]
SELECT 1 AS one FROM "locations" WHERE "locations"."slug" = ? LIMIT ?  [["slug", "minirt"], ["LIMIT", 1]]
SELECT "locations".* FROM "locations"
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 57]]
---
    def destroy
		if Location.where(id: params[:id]).exists? || Location.where(slug: params[:id]).exists?
			@locations = Location.all
			@location = Location.friendly.find(params[:id])
			@location.destroy