app/controllers/locations_controller.rb

    def create
        @location = Location.create(
            latitude: params[:latitude],
            longitude: params[:longitude],
            slug_name: params[:slug_name]
        )
---
INSERT INTO "locations" ("latitude", "longitude", "slug_name", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["latitude", "51.054"], ["longitude", "3.717"], ["slug_name", "gand"], ["created_at", "2021-07-21 02:38:23.970851"], ["updated_at", "2021-07-21 02:38:23.970851"], ["slug", "gand"]]

    def update
        @location = Location.find(params[:id])
        @location.update(
            latitude: params[:latitude],
            longitude: params[:longitude],
            slug_name: params[:slug_name]
        )
---
UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "slug_name" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["latitude", "56"], ["longitude", nil], ["slug_name", nil], ["updated_at", "2021-07-21 04:31:39.178253"], ["id", 1]]

    def destroy
        @locations = Location.all
        @location = Location.find(params[:id])
        @location.destroy
---
SELECT "locations".* FROM "locations"
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]